Reports/СверкаРасчетовСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СверкаРасчетовСКонтрагентами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВключатьОбособленныеПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеДополнительныхПолей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьОтчетПриИзмененииНастроек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предопределенная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предопределенная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Enums/СервисСверкиРасчетовВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СервисСверкиРасчетовВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРеализации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСредствОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСредствПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеСредствПрочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПрочая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторноДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КурсовыеРазницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Санкции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммовыеРазницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КурсовыеРазницыУЕ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Займ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацииПоЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Претензия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/СверкаРасчетовСКонтрагентами/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует набор параметров, задающих флаги выполнения дополнительных действий над сущностями, обрабатываемыми
// в процессе формирования отчета.
//
// Возвращаемое значение:
//   Структура   - флаги, задающие необходимость дополнительных действий.
//
Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	ПараметрыВыполненияОтчета = Новый Структура;
	ПараметрыВыполненияОтчета.Вставить("ИспользоватьПередКомпоновкойМакета",          Истина);
	ПараметрыВыполненияОтчета.Вставить("ИспользоватьПослеКомпоновкиМакета" ,          Ложь);
	ПараметрыВыполненияОтчета.Вставить("ИспользоватьПослеВыводаРезультата",           Истина);
	ПараметрыВыполненияОтчета.Вставить("ИспользоватьДанныеРасшифровки",               Истина);
	ПараметрыВыполненияОтчета.Вставить("ИспользоватьРасширенныеПараметрыРасшифровки", Ложь);
	
	Возврат ПараметрыВыполненияОтчета;
	
КонецФункции

// Возвращает структуру параметров, наличие которых требуется для успешного формирования отчета.
//
// Возвращаемое значение:
//   Структура - структура параметров для формирования отчета.
//
Функция ПустыеПараметрыКомпоновкиОтчета() Экспорт
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация",                       Справочники.Организации.ПустаяСсылка());
	ПараметрыОтчета.Вставить("ВключатьОбособленныеПодразделения", Ложь);
	ПараметрыОтчета.Вставить("Контрагент",                        Справочники.Контрагенты.ПустаяСсылка());
	ПараметрыОтчета.Вставить("ВыводитьЗаголовок" ,                Ложь);
	ПараметрыОтчета.Вставить("ВыводитьПодвал",                    Ложь);
	ПараметрыОтчета.Вставить("МакетОформления",                   Неопределено);
	ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных",             Неопределено);
	ПараметрыОтчета.Вставить("ИдентификаторОтчета",               "");
	ПараметрыОтчета.Вставить("НастройкиКомпоновкиДанных",         Неопределено);
	ПараметрыОтчета.Вставить("ДанныеРасшифровки",                 Неопределено);
	ПараметрыОтчета.Вставить("ДополнительныеПоля",                Неопределено);
	ПараметрыОтчета.Вставить("БыстрыйОтбор",                      "");
	ПараметрыОтчета.Вставить("НачалоПериода",                     Дата(1,1,1));
	ПараметрыОтчета.Вставить("КонецПериода",                      Дата(1,1,1));
	ПараметрыОтчета.Вставить("ВыводитьОрганизацию",               Истина);
	ПараметрыОтчета.Вставить("ИдентификаторыРасхождений",         Неопределено);
	ПараметрыОтчета.Вставить("ОтборОтличаетсяСумма",              Ложь);
	ПараметрыОтчета.Вставить("ОтборОтличаетсяСФ",                 Ложь);
	ПараметрыОтчета.Вставить("ОтборОтсутствуетДокумент",          Ложь);
	ПараметрыОтчета.Вставить("ОтборКонтрагентНеУчитываетНДС",     Ложь);
	ПараметрыОтчета.Вставить("ОтборОтличаетсяПервичныйДокумент",  Ложь);
	ПараметрыОтчета.Вставить("ОтборБезРасхождений",               Ложь);
	ПараметрыОтчета.Вставить("ОтборНеСверено",                    Ложь);
	ПараметрыОтчета.Вставить("ТребуетсяОтправкаДокументов",       Ложь);
	ПараметрыОтчета.Вставить("ОжидаемДокументыОтКонтрагента",     Ложь);
	ПараметрыОтчета.Вставить("КонтрагентНеПодключенКСервису",     Ложь);
	ПараметрыОтчета.Вставить("ДатаАктуальности",                  Дата(1,1,1));
	ПараметрыОтчета.Вставить("ИнтерфейсТакси",                    Ложь);
	
	ПараметрыОтчета.Вставить("ПоказатьВсе", Ложь);
	
	Возврат ПараметрыОтчета;
	
КонецФункции

Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	КомпоновщикНастроек.ЗагрузитьНастройки(Схема.ВариантыНастроек.Найти(ПараметрыОтчета.ИдентификаторМакета).Настройки);
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.НачалоПериода) Тогда
		УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(ПараметрыОтчета.НачалоПериода));
	Иначе
		УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", СервисСверкиРасчетов.ДатаНачалаСверкиРасчетов());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.КонецПериода) Тогда
		УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(ПараметрыОтчета.КонецПериода));
	Иначе
		УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецМесяца(ТекущаяДатаСеанса()));
	КонецЕсли;
	
	УстановитьПараметр(КомпоновщикНастроек, "ОперацияПоступление", Перечисления.СервисСверкиРасчетовВидыОпераций.Поступление);
	УстановитьПараметр(КомпоновщикНастроек, "ОтборОтличаетсяСумма", ПараметрыОтчета.ОтборОтличаетсяСумма);
	УстановитьПараметр(КомпоновщикНастроек, "ОтборОтличаетсяСФ", ПараметрыОтчета.ОтборОтличаетсяСФ);
	УстановитьПараметр(КомпоновщикНастроек, "ОтборОтсутствуетДокумент", ПараметрыОтчета.ОтборОтсутствуетДокумент);
	УстановитьПараметр(КомпоновщикНастроек, "ОтборКонтрагентНеУчитываетНДС", ПараметрыОтчета.ОтборКонтрагентНеУчитываетНДС);
	УстановитьПараметр(КомпоновщикНастроек, "ОтборОтличаетсяПервичныйДокумент", ПараметрыОтчета.ОтборОтличаетсяПервичныйДокумент);
	УстановитьПараметр(КомпоновщикНастроек, "ОтборБезРасхождений", ПараметрыОтчета.ОтборБезРасхождений);
	УстановитьПараметр(КомпоновщикНастроек, "ОтборНеСверено", ПараметрыОтчета.ОтборНеСверено);
	УстановитьПараметр(КомпоновщикНастроек, "ТребуетсяОтправкаДокументов", ПараметрыОтчета.ТребуетсяОтправкаДокументов);
	УстановитьПараметр(КомпоновщикНастроек, "ОжидаемДокументыОтКонтрагента", ПараметрыОтчета.ОжидаемДокументыОтКонтрагента);
	УстановитьПараметр(КомпоновщикНастроек, "КонтрагентНеПодключенКСервису", ПараметрыОтчета.КонтрагентНеПодключенКСервису);
	УстановитьПараметр(КомпоновщикНастроек, "ПоказатьВсе", ПараметрыОтчета.ПоказатьВсе);
	УстановитьПараметр(КомпоновщикНастроек, "ИнтерфейсТакси", ПараметрыОтчета.ИнтерфейсТакси);
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.Организация) Тогда
		
		Если ПараметрыОтчета.ВключатьОбособленныеПодразделения Тогда
			Отбор = КомпоновщикНастроек.Настройки.Отбор;
			ГруппаОтборОрганизация = Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаОтборОрганизация.Представление = "###ОтборПоОрганизацииСОП###";
			ГруппаОтборОрганизация.ТипГруппы     = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			Если ПараметрыОтчета.ОтборНеСверено Тогда
				ДобавитьОтбор(ГруппаОтборОрганизация, "ОрганизацияНеСверено",            ПараметрыОтчета.Организация);
				ДобавитьОтбор(ГруппаОтборОрганизация, "ОрганизацияНеСверено.ГоловнаяОрганизация", ПараметрыОтчета.Организация);
			Иначе
				ДобавитьОтбор(ГруппаОтборОрганизация, "Организация"                    , ПараметрыОтчета.Организация);
				ДобавитьОтбор(ГруппаОтборОрганизация, "Организация.ГоловнаяОрганизация", ПараметрыОтчета.Организация);
			КонецЕсли;
		Иначе
			Если ПараметрыОтчета.ОтборНеСверено Тогда
				НовыйОтбор = ДобавитьОтбор(КомпоновщикНастроек, "ОрганизацияНеСверено", ПараметрыОтчета.Организация,,, Истина); 
			Иначе
				НовыйОтбор = ДобавитьОтбор(КомпоновщикНастроек, "Организация", ПараметрыОтчета.Организация,,, Истина);
			КонецЕсли;
			НовыйОтбор.Представление = "###ОтборПоОрганизации###";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.Контрагент) Тогда
		
		Если ПараметрыОтчета.Контрагент.ЭтоГруппа Тогда
			ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВИерархии;
		Иначе
			ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
		
		Если ПараметрыОтчета.ОтборНеСверено Тогда
			НовыйОтбор = ДобавитьОтбор(КомпоновщикНастроек, "КонтрагентНеСверено", ПараметрыОтчета.Контрагент,ВидСравненияОтбора,, Истина);
		Иначе
			НовыйОтбор = ДобавитьОтбор(КомпоновщикНастроек, "Контрагент", ПараметрыОтчета.Контрагент,ВидСравненияОтбора,, Истина);
		КонецЕсли;
		НовыйОтбор.Представление = "###ОтборПоКонтрагенту###"; 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.ИдентификаторыРасхождений) И НЕ ПараметрыОтчета.ОтборНеСверено Тогда
		НовыйОтбор = ДобавитьОтбор(КомпоновщикНастроек, "ИдентификаторРасхождения", ПараметрыОтчета.ИдентификаторыРасхождений,ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
		НовыйОтбор.Представление = "###ОтборПоИдентификаторРасхождения###";
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьОтбор(ЭлементСтруктуры, Знач Поле, Значение = Неопределено, ВидСравнения = Неопределено, Использование = Истина, ВПользовательскиеНастройки = Ложь) Экспорт
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Настройки.Отбор;
		
		Если ВПользовательскиеНастройки Тогда
			Для Каждого ЭлементНастройки Из ЭлементСтруктуры.ПользовательскиеНастройки.Элементы Цикл	
				Если ЭлементНастройки.ИдентификаторПользовательскойНастройки = ЭлементСтруктуры.Настройки.Отбор.ИдентификаторПользовательскойНастройки Тогда
					Отбор = ЭлементНастройки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("НастройкиКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Отбор;
	Иначе
		Отбор = ЭлементСтруктуры;
	КонецЕсли;
		
	Если ВидСравнения = Неопределено Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	ЗначениеОтбораКомпоновки = Значение;
	// Механизмы компоновки в качестве списка принимают СписокЗначений,
	// но не более очевидную коллекцию - Массив.
	ТипЗначенияОтбора = ТипЗнч(Значение);
	Если ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
		Или ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии
		Или ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
		Или ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
		
		Если ТипЗначенияОтбора = Тип("Массив") Тогда
			ЗначениеОтбораКомпоновки = Новый СписокЗначений;
			ЗначениеОтбораКомпоновки.ЗагрузитьЗначения(Значение);
		ИначеЕсли ТипЗначенияОтбора = Тип("ФиксированныйМассив") Тогда
			ЗначениеОтбораКомпоновки = Новый СписокЗначений;
			ЗначениеОтбораКомпоновки.ЗагрузитьЗначения(Новый Массив(Значение));
		КонецЕсли;
		
	КонецЕсли;
	
	НовыйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.Использование  = Использование;
	НовыйЭлемент.ЛевоеЗначение  = Поле;
	НовыйЭлемент.ВидСравнения   = ВидСравнения;
	НовыйЭлемент.ПравоеЗначение = ЗначениеОтбораКомпоновки;
	
	Возврат НовыйЭлемент;
	
КонецФункции

Функция УстановитьПараметр(Настройки, Параметр, Значение, Использование = Истина) Экспорт
	
	ЗначениеПараметра = ПолучитьПараметр(Настройки, Параметр);
	
	Если ЗначениеПараметра <> Неопределено Тогда
		ЗначениеПараметра.Использование = Использование;
		ЗначениеПараметра.Значение      = Значение;
	КонецЕсли;
	
	Возврат ЗначениеПараметра;
	
КонецФункции

Функция ПолучитьПараметр(Настройки, Параметр) Экспорт
	
	ЗначениеПараметра = Неопределено;
	ПолеПараметр = ?(ТипЗнч(Параметр) = Тип("Строка"), Новый ПараметрКомпоновкиДанных(Параметр), Параметр);
	
	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Тогда
		ЗначениеПараметра = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
	ИначеЕсли ТипЗнч(Настройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		Для Каждого ЭлементНастройки Из Настройки.Элементы Цикл
			Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И ЭлементНастройки.Параметр = ПолеПараметр Тогда
				ЗначениеПараметра = ЭлементНастройки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Настройки) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Для Каждого ЭлементНастройки Из Настройки.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И ЭлементНастройки.Параметр = ПолеПараметр Тогда
				ЗначениеПараметра = ЭлементНастройки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеПараметра = Неопределено Тогда
			ЗначениеПараметра = Настройки.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Настройки) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		ЗначениеПараметра = Настройки.Найти(ПолеПараметр);
	ИначеЕсли ТипЗнч(Настройки) = Тип("ОформлениеКомпоновкиДанных") Тогда
		ЗначениеПараметра = Настройки.НайтиЗначениеПараметра(ПолеПараметр);
	КонецЕсли;
	
	Возврат ЗначениеПараметра;
	
КонецФункции

// В процедуре можно изменить табличный документ после вывода в него данных.
//
// Параметры:
//  ПараметрыОтчета - Структура - см. ПустыеПараметрыКомпоновкиОтчета()
//  Результат    - ТабличныйДокумент - сформированный отчет.
//
Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	Если ПараметрыОтчета.ОтборНеСверено Тогда
		Если ЗначениеЗаполнено(ПараметрыОтчета.Организация)
			И НЕ ПараметрыОтчета.ВключатьОбособленныеПодразделения Тогда
			УровеьГруппировки        = 1;
		Иначе 
			УровеьГруппировки        = 2;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыОтчета.Организация) Тогда
			Результат.ФиксацияСверху = 3;
		Иначе
			Результат.ФиксацияСверху = 2;
		КонецЕсли;
		
		Результат.ПоказатьУровеньГруппировокСтрок(УровеьГруппировки);
	КонецЕсли;
	
	СервисСверкиРасчетовПереопределяемый.ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);
	
КонецПроцедуры

Функция ПолучитьТекстЗаголовка(ПараметрыОтчета) Экспорт
	
	ТекстЗаголовкаКонтрагент = НСтр("ru = ' с контрагентами'");
	Если ЗначениеЗаполнено(ПараметрыОтчета.Контрагент) Тогда
		Если ПараметрыОтчета.Контрагент.ЭтоГруппа Тогда
			ТекстЗаголовкаКонтрагент = НСтр("ru = ' с контрагентами в группе '");
		Иначе
			ТекстЗаголовкаКонтрагент = НСтр("ru = ' с контрагентом '");
		КонецЕсли;
	КонецЕсли;
	ТекстЗаголовок = ПараметрыОтчета.СхемаКомпоновкиДанных.ВариантыНастроек[ПараметрыОтчета.ИдентификаторМакета].Представление 
		+ ?(ЗначениеЗаполнено(ПараметрыОтчета.Контрагент), ТекстЗаголовкаКонтрагент + Строка(ПараметрыОтчета.Контрагент), ТекстЗаголовкаКонтрагент);
	
	Возврат ТекстЗаголовок + ПолучитьПредставлениеПериода(ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.КонецПериода);
	
КонецФункции

Функция ПолучитьПредставлениеПериода(НачалоПериода = '00010101', КонецПериода = '00010101')
	
	ТекстПериод = "";
	
	Если ЗначениеЗаполнено(КонецПериода) Тогда 
		Если КонецПериода >= НачалоПериода Тогда
			ТекстПериод = " " + НСтр("ru = 'за'")+ " ";
			ТекстПериод = ТекстПериод
				+ ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП = Истина");	
		Иначе
			ТекстПериод = "";
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(НачалоПериода) Тогда
		ТекстПериод = " " + НСтр("ru = 'за'")+ " "
			+ ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(Дата(3999, 11, 11)), "ФП = Истина");
		ТекстПериод = СтрЗаменить(ТекстПериод, Сред(ТекстПериод, СтрНайти(ТекстПериод, " - ")), " - ...");
	КонецЕсли;
	
	Возврат ТекстПериод;
	
КонецФункции

#КонецОбласти

#КонецЕсли
